[
  {
    "location": "Bern, Switzerland",
    "role": "Senior Software Engineer",
    "title": "Interdiscount",
    "description": "Interdiscount is the leading omnichannel retailer for electronic goods and part of the Coop group. I played a key role in the modernization of our frontend architecture and backend microservices.",
    "date": "June 2023 - Present",
    "tools": [
      "React",
      "Next.js",
      "Angular",
      "GCP",
      "Kubernetes",
      "Java",
      "Spring Boot",
      "ArgoCD",
      "Wiz"
    ]
  },
  {
    "location": "Singapore",
    "role": "Full-Stack Software Engineer",
    "title": "One X Tech",
    "description": "One X Tech is a business technology partner, focused on building technological innovations for leading enterprises.",
    "date": "May 2022 - June 2023",
    "tools": [
      "AWS",
      "Supabase",
      "React",
      "Next.js",
      "TypeScript",
      "Redux",
      "Node.js",
      "Turborepo",
      "Nx",
      "Mapbox",
      "DeckGL"
    ]
  },
  {
    "location": "Jena, Germany",
    "role": "Full-Stack Software Engineer",
    "title": "diva-e",
    "description": "At diva-e, a leading software development service provider, I focused on crafting and enhancing digital experiences to elevate customer interactions. My role primarily involved developing and refining front-end code bases, while also leveraging my back-end expertise. I gained extensive experience working in agile teams and successfully led projects and conducted technical interviews.",
    "date": "November 2019 - May 2022",
    "tools": [
      "Angular",
      "RxJs",
      "NgRx",
      "Handlebars",
      "Java",
      "Spring Boot"
    ]
  },
  {
    "location": "Jena, Germany",
    "role": "Full-Stack Software Engineer",
    "title": "Freelancer",
    "description": "One of the highlights of my freelance work involved designing a scalable application infrastructure and developing a Python-based backend for a cloud-hosted computer vision platform. I also architected and implemented a batch workload processing system tailored for a subscription-based business model, ensuring performance, scalability, and cost-efficiency.\n\n",
    "date": "January 2018 - November 2020",
    "tools": ["AWS", "Python", "TypeScript", "React", "Angular"]
  },
  {
    "location": "Bangkok, Thailand",
    "role": "Assistant Manager & Web Developer",
    "title": "Win-Win Asia",
    "description": "As part of the management team at Win-Win Asia, I was responsible for overseeing staff and ensuring smooth day-to-day operations. In addition to my managerial role, I leveraged off-season periods to enhance and optimize the company’s WordPress websites and internal tools, contributing to improved digital performance and operational efficiency.",
    "date": "June 2019 - October 2019",
    "tools": [
      "WordPress",
      "PHP",
      "HTML",
      "CSS",
      "JavaScript"
    ]
  }
]
